src/Reports/ОтчётПоСборкеДоставкеИтоговый/ОтчётПоСборкеДоставкеИтоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоСборкеДоставкеИтоговый</name>
</mdclass:Report>

src/Enums/ЗоныКомплектации/ЗоныКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗоныКомплектации</name>
  <enumValues>
    <name>УПЭА</name>
  </enumValues>
  <enumValues>
    <name>УД</name>
  </enumValues>
  <enumValues>
    <name>ДД</name>
  </enumValues>
  <enumValues>
    <name>ТНП</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НумераторГрупповыхУпаковокDanfoss/НумераторГрупповыхУпаковокDanfoss.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НумераторГрупповыхУпаковокDanfoss</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СледующийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВТаре</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСброса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ОтчётПоСборкеДоставкеИтоговый/Forms/ФормаОтчета/Module.bsl
&НаСервере         
Функция ПолучитьКоличествоВТаре(Товар)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НумераторГрупповыхУпаковокDanfoss.Товар КАК Товар,
	|	НумераторГрупповыхУпаковокDanfoss.КоличествоВТаре КАК КоличествоВТаре
	|ИЗ
	|	Справочник.НумераторГрупповыхУпаковокDanfoss КАК НумераторГрупповыхУпаковокDanfoss
	|ГДЕ
	|	НумераторГрупповыхУпаковокDanfoss.Товар = &Товар";
Запрос.УстановитьПараметр("Товар", Товар);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.КоличествоВТаре);
	КонецЦикла;
Возврат(1);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗоны(ННС,ЗонаКомплектации)
Запрос = Новый Запрос; 
Парам = Новый Структура("Количество,КоличествоГУ,КоличествоВГУ",0,0,0);

	Если ЗонаКомплектации = Перечисления.ЗоныКомплектации.ТНП Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка = &Ссылка
		|	И (ТИПЗНАЧЕНИЯ(НакладнаяНаСборкуТабличнаяЧасть.Продукция) = ТИП(Справочник.Материалы)
		|			ИЛИ НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации)
		|	И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.ПометкаУдаления = ЛОЖЬ
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Продукция";	
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка = &Ссылка
		|	И НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации
		|	И НакладнаяНаСборкуТабличнаяЧасть.Ссылка.ПометкаУдаления = ЛОЖЬ
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Продукция";	
	КонецЕсли; 
Запрос.УстановитьПараметр("Ссылка", ННС);
Запрос.УстановитьПараметр("ЗонаКомплектации", ЗонаКомплектации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПродукция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПродукция.Следующий() Цикл
	КоличествоВТаре = ПолучитьКоличествоВТаре(ВыборкаПродукция.Продукция.Товар);
		Если КоличествоВТаре > 1 Тогда 
		КоличествоГУ = Окр(ВыборкаПродукция.Количество/КоличествоВТаре,1,РежимОкругления.Окр15как20); 
			Если Цел(КоличествоГУ) = 0 Тогда
			КоличествоГУ = 1;
			Иначе	
				Если КоличествоГУ/Цел(КоличествоГУ) > 1 Тогда
				КоличествоГУ = Цел(КоличествоГУ) + 1;
				КонецЕсли;			
			КонецЕсли; 
		Парам.КоличествоГУ = Парам.КоличествоГУ + КоличествоГУ;
		Парам.КоличествоВГУ = Парам.КоличествоВГУ + ВыборкаПродукция.Количество;
		Иначе	
		Парам.Количество = Парам.Количество + ВыборкаПродукция.Количество;
		КонецЕсли;	
	КонецЦикла;
Возврат(Парам);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;
СписокЗонКомплектации = Новый СписокЗначений;
СписокИсполнителей = Новый СписокЗначений;

	Если ЗонаКомплектации.Пустая() Тогда
	СписокЗонКомплектации.Добавить(Перечисления.ЗоныКомплектации.УПЭА);
	СписокЗонКомплектации.Добавить(Перечисления.ЗоныКомплектации.УД);
	СписокЗонКомплектации.Добавить(Перечисления.ЗоныКомплектации.ДД);
	СписокЗонКомплектации.Добавить(Перечисления.ЗоныКомплектации.ТНП);    
	Иначе	
	СписокЗонКомплектации.Добавить(ЗонаКомплектации);
	КонецЕсли;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаСобрано = Макет.ПолучитьОбласть("Шапка|Собрано");
ОблШапкаИтогоСобрано = Макет.ПолучитьОбласть("Шапка|ИтогоСобрано");
ОблШапкаДоставлено = Макет.ПолучитьОбласть("Шапка|Доставлено");
ОблШапкаИтогоДоставлено = Макет.ПолучитьОбласть("Шапка|ИтогоДоставлено");
ОблСотрудникОбщие = Макет.ПолучитьОбласть("Сотрудник|Общие");	
ОблСотрудникСобрано = Макет.ПолучитьОбласть("Сотрудник|Собрано");
ОблСотрудникИтогоСобрано = Макет.ПолучитьОбласть("Сотрудник|ИтогоСобрано");
ОблСотрудникОбщие = Макет.ПолучитьОбласть("Сотрудник|Общие");	
ОблСотрудникДоставлено = Макет.ПолучитьОбласть("Сотрудник|Доставлено");
ОблСотрудникИтогоДоставлено = Макет.ПолучитьОбласть("Сотрудник|ИтогоДоставлено");
ОблИтогоОбщие = Макет.ПолучитьОбласть("Итого|Общие");	
ОблИтогоСобрано = Макет.ПолучитьОбласть("Итого|Собрано");
ОблИтогоИтогоСобрано = Макет.ПолучитьОбласть("Итого|ИтогоСобрано");
ОблИтогоДоставлено = Макет.ПолучитьОбласть("Итого|Доставлено");
ОблИтогоИтогоДоставлено = Макет.ПолучитьОбласть("Итого|ИтогоДоставлено");

ОблШапкаОбщие.Параметры.ДатаНач = Период.ДатаНачала;
ОблШапкаОбщие.Параметры.ДатаКон = Период.ДатаОкончания;
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого ЗК Из СписокЗонКомплектации Цикл
	ОблШапкаСобрано.Параметры.ЗК = "C: "+ЗК.Значение;
	ТабДок.Присоединить(ОблШапкаСобрано);
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтогоСобрано);
	Для каждого ЗК Из СписокЗонКомплектации Цикл
	ОблШапкаДоставлено.Параметры.ЗК = "Д: "+ЗК.Значение;
	ТабДок.Присоединить(ОблШапкаДоставлено);
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтогоДоставлено);

Запрос.Текст =
	"ВЫБРАТЬ
	|	НакладнаяНаСборкуЗоныКомплектации.Исполнитель КАК Исполнитель,
	|	НакладнаяНаСборкуЗоныКомплектации.ЗонаКомплектации КАК ЗонаКомплектации,
	|	НакладнаяНаСборкуЗоныКомплектации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаСборку.ЗоныКомплектации КАК НакладнаяНаСборкуЗоныКомплектации
	|ГДЕ
	|	НакладнаяНаСборкуЗоныКомплектации.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон     
	|	И НакладнаяНаСборкуЗоныКомплектации.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НакладнаяНаСборкуЗоныКомплектации.ЗонаКомплектации В(&СписокЗонКомплектации)"; 
	Если СписокСотрудников.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборкуЗоныКомплектации.Исполнитель В(&СписокСотрудников)";		
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);	
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО
								|	Исполнитель,
								|	ЗонаКомплектации,
								|	Ссылка";		 
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЗонКомплектации", СписокЗонКомплектации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИсполнительСобрано = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИсполнительСобрано.Следующий() Цикл
	СписокИсполнителей.Добавить(ВыборкаИсполнительСобрано.Исполнитель)	
	КонецЦикла;
Запрос.Текст =
	"ВЫБРАТЬ
	|	НакладнаяНаСборкуТары.Исполнитель КАК Исполнитель,
	|	НакладнаяНаСборкуТары.ЗонаКомплектации КАК ЗонаКомплектации,
	|	НакладнаяНаСборкуТары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаСборку.Тары КАК НакладнаяНаСборкуТары
	|ГДЕ
	|	НакладнаяНаСборкуТары.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон
	|	И НакладнаяНаСборкуТары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НакладнаяНаСборкуТары.ЗонаКомплектации В(&СписокЗонКомплектации)";
	Если СписокСотрудников.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборкуТары.Исполнитель В(&СписокСотрудников)";		
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);	
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО
								|	Исполнитель,
								|	ЗонаКомплектации,
								|	Ссылка";
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЗонКомплектации", СписокЗонКомплектации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИсполнительДоставлено = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИсполнительДоставлено.Следующий() Цикл
		Если СписокИсполнителей.НайтиПоЗначению(ВыборкаИсполнительДоставлено.Исполнитель) = Неопределено Тогда
		СписокИсполнителей.Добавить(ВыборкаИсполнительДоставлено.Исполнитель)
		КонецЕсли;	
	КонецЦикла;
СписокИсполнителей.СортироватьПоЗначению();
КоличествоСобраноВсего = 0;
КоличествоДоставленоВсего = 0;
КоличествоСобраноВсего = 0;
КоличествоДоставленоВсего = 0;
КоличествоГУСобраноВсего = 0;
КоличествоГУДоставленоВсего = 0;
КоличествоВГУСобраноВсего = 0;
КоличествоВГУДоставленоВсего = 0;
	Для каждого Сотрудник Из СписокИсполнителей Цикл	
	ОблСотрудникОбщие.Параметры.Сотрудник = Сотрудник.Значение;
	ТабДок.Вывести(ОблСотрудникОбщие);
	КоличествоИтого = 0;
	КоличествоГУИтого = 0;
	КоличествоВГУИтого = 0;
	ВыборкаИсполнительСобрано.Сбросить();
		Если ВыборкаИсполнительСобрано.НайтиСледующий(Новый Структура("Исполнитель",Сотрудник.Значение)) Тогда	
		ВыборкаЗонаКомплектации = ВыборкаИсполнительСобрано.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Для каждого ЗК Из СписокЗонКомплектации Цикл
			Количество = 0;
			КоличествоГУ = 0;
			КоличествоВГУ = 0;
			ВыборкаЗонаКомплектации.Сбросить();
				Пока ВыборкаЗонаКомплектации.НайтиСледующий(Новый Структура("ЗонаКомплектации",ЗК.Значение)) Цикл
				ВыборкаСсылки = ВыборкаЗонаКомплектации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСсылки.Следующий() Цикл
					Результат = ПолучитьКоличествоЗоны(ВыборкаСсылки.Ссылка,ЗК.Значение);
					Количество = Количество + Результат.Количество;
					КоличествоГУ = КоличествоГУ + Результат.КоличествоГУ;
					КоличествоВГУ = КоличествоВГУ + Результат.КоличествоВГУ;
					КонецЦикла;
				КонецЦикла;
			ОблСотрудникСобрано.Параметры.Количество = Количество;
			ТабДок.Присоединить(ОблСотрудникСобрано);
			КоличествоИтого = КоличествоИтого + Количество + КоличествоВГУ;
			КоличествоГУИтого = КоличествоГУИтого + КоличествоГУ; 
			КоличествоВГУИтого = КоличествоВГУИтого + КоличествоВГУ;				
			КонецЦикла;
	    ОблСотрудникИтогоСобрано.Параметры.Количество = КоличествоИтого;
	    ОблСотрудникИтогоСобрано.Параметры.КоличествоГУ = КоличествоГУИтого;
	    ОблСотрудникИтогоСобрано.Параметры.КоличествоВГУ = КоличествоВГУИтого;
		ТабДок.Присоединить(ОблСотрудникИтогоСобрано);
		КоличествоСобраноВсего = КоличествоСобраноВсего + КоличествоИтого;
		КоличествоГУСобраноВсего = КоличествоГУСобраноВсего + КоличествоГУИтого;
		КоличествоВГУСобраноВсего = КоличествоВГУСобраноВсего + КоличествоВГУИтого;
		Иначе
			Для каждого ЗК Из СписокЗонКомплектации Цикл
			ОблСотрудникСобрано.Параметры.Количество = 0;
			ТабДок.Присоединить(ОблСотрудникСобрано);				
			КонецЦикла;
	    ОблСотрудникИтогоСобрано.Параметры.Количество = 0;
	    ОблСотрудникИтогоСобрано.Параметры.КоличествоГУ = 0;
	    ОблСотрудникИтогоСобрано.Параметры.КоличествоВГУ = 0;
		ТабДок.Присоединить(ОблСотрудникИтогоСобрано);
		КонецЕсли;
	КоличествоИтого = 0;
	КоличествоГУИтого = 0; 
	КоличествоВГУИтого = 0;
	ВыборкаИсполнительДоставлено.Сбросить();
		Если ВыборкаИсполнительДоставлено.НайтиСледующий(Новый Структура("Исполнитель",Сотрудник.Значение)) Тогда	
		ВыборкаЗонаКомплектации = ВыборкаИсполнительДоставлено.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Для каждого ЗК Из СписокЗонКомплектации Цикл
			Количество = 0;
			КоличествоГУ = 0;
			КоличествоВГУ = 0;
			ВыборкаЗонаКомплектации.Сбросить();
				Если ВыборкаЗонаКомплектации.НайтиСледующий(Новый Структура("ЗонаКомплектации",ЗК.Значение)) Тогда
				ВыборкаСсылки = ВыборкаЗонаКомплектации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСсылки.Следующий() Цикл
					Результат = ПолучитьКоличествоЗоны(ВыборкаСсылки.Ссылка,ЗК.Значение);
					Количество = Количество + Результат.Количество;
					КоличествоГУ = КоличествоГУ + Результат.КоличествоГУ;
					КоличествоВГУ = КоличествоВГУ + Результат.КоличествоВГУ;
					КонецЦикла;
				КонецЕсли;
			ОблСотрудникДоставлено.Параметры.Количество = Количество;
			ТабДок.Присоединить(ОблСотрудникДоставлено);
			КоличествоИтого = КоличествоИтого + Количество + КоличествоВГУ;
			КоличествоГУИтого = КоличествоГУИтого + КоличествоГУ;
			КоличествоВГУИтого = КоличествоВГУИтого + КоличествоВГУ;
			КонецЦикла;
	    ОблСотрудникИтогоДоставлено.Параметры.Количество = КоличествоИтого;
	    ОблСотрудникИтогоДоставлено.Параметры.КоличествоГУ = КоличествоГУИтого;
	    ОблСотрудникИтогоДоставлено.Параметры.КоличествоВГУ = КоличествоВГУИтого;
		ТабДок.Присоединить(ОблСотрудникИтогоДоставлено);
		КоличествоДоставленоВсего = КоличествоДоставленоВсего + КоличествоИтого;
		КоличествоГУДоставленоВсего = КоличествоГУДоставленоВсего + КоличествоГУИтого;
		КоличествоВГУДоставленоВсего = КоличествоВГУДоставленоВсего + КоличествоВГУИтого;
		Иначе
			Для каждого ЗК Из СписокЗонКомплектации Цикл
			ОблСотрудникДоставлено.Параметры.Количество = 0;
			ТабДок.Присоединить(ОблСотрудникДоставлено);				
			КонецЦикла;
	    ОблСотрудникИтогоДоставлено.Параметры.Количество = 0;
	    ОблСотрудникИтогоДоставлено.Параметры.КоличествоГУ = 0;
	    ОблСотрудникИтогоДоставлено.Параметры.КоличествоВГУ = 0;
		ТабДок.Присоединить(ОблСотрудникИтогоДоставлено);
		КонецЕсли;
	КонецЦикла;
ТабДок.Вывести(ОблИтогоОбщие); 
	Для каждого ЗК Из СписокЗонКомплектации Цикл
	Количество = 0;
	КоличествоГУ = 0; 
	КоличествоВГУ = 0;
	ВыборкаИсполнительСобрано.Сбросить();
		Пока ВыборкаИсполнительСобрано.Следующий() Цикл	
		ВыборкаЗонаКомплектации = ВыборкаИсполнительСобрано.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗонаКомплектации.НайтиСледующий(Новый Структура("ЗонаКомплектации",ЗК.Значение)) Цикл
			ВыборкаСсылки = ВыборкаЗонаКомплектации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСсылки.Следующий() Цикл
				Результат = ПолучитьКоличествоЗоны(ВыборкаСсылки.Ссылка,ЗК.Значение);
				Количество = Количество + Результат.Количество;
				КоличествоГУ = КоличествоГУ + Результат.КоличествоГУ;
				КоличествоВГУ = КоличествоВГУ + Результат.КоличествоВГУ;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	ОблИтогоСобрано.Параметры.Количество = Количество;
	ТабДок.Присоединить(ОблИтогоСобрано);
	КонецЦикла;
ОблИтогоИтогоСобрано.Параметры.Количество = КоличествоСобраноВсего;
ОблИтогоИтогоСобрано.Параметры.КоличествоГУ = КоличествоГУСобраноВсего;
ОблИтогоИтогоСобрано.Параметры.КоличествоВГУ = КоличествоВГУСобраноВсего;
ТабДок.Присоединить(ОблИтогоИтогоСобрано); 
	Для каждого ЗК Из СписокЗонКомплектации Цикл
	Количество = 0;
	КоличествоГУ = 0;
	КоличествоВГУ = 0;
	ВыборкаИсполнительДоставлено.Сбросить();
		Пока ВыборкаИсполнительДоставлено.Следующий() Цикл	
		ВыборкаЗонаКомплектации = ВыборкаИсполнительДоставлено.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗонаКомплектации.НайтиСледующий(Новый Структура("ЗонаКомплектации",ЗК.Значение)) Цикл
			ВыборкаСсылки = ВыборкаЗонаКомплектации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСсылки.Следующий() Цикл
				Результат = ПолучитьКоличествоЗоны(ВыборкаСсылки.Ссылка,ЗК.Значение);
				Количество = Количество + Результат.Количество;
				КоличествоГУ = КоличествоГУ + Результат.КоличествоГУ;
				КоличествоВГУ = КоличествоВГУ + Результат.КоличествоВГУ;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	ОблИтогоДоставлено.Параметры.Количество = Количество;
	ТабДок.Присоединить(ОблИтогоДоставлено);
	КонецЦикла;
ОблИтогоИтогоДоставлено.Параметры.Количество = КоличествоДоставленоВсего;
ОблИтогоИтогоДоставлено.Параметры.КоличествоГУ = КоличествоГУДоставленоВсего;
ОблИтогоИтогоДоставлено.Параметры.КоличествоВГУ = КоличествоВГУДоставленоВсего;
ТабДок.Присоединить(ОблИтогоИтогоДоставлено); 
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
